/**
*? Напишіть код, який запитуватиме
*? логін за допомогою prompt та логувати результат
*? у консоль браузера
    
*? Якщо відвідувач вводить "Адмін",
*? то prompt запитує пароль.
*? Якщо нічого не ввели або натиснуто клавішу Esc
*? вивести рядок "Скасовано"
*? В іншому випадку вивести рядок "Я вас не знаю"
    
*? Пароль перевіряти так:
*? Якщо введено пароль "Я головний",
*? то вивести рядок "Здрастуйте!"
*? інакше виводити рядок "Невірний пароль!"
  */

const login = prompt("Введіть логін");
console.log(login);

if ("Адмін" === login) {
  const password = prompt("Введіть пароль");
  if (!password) {
    console.log("Скасовано");
  } else {
    if ("Я головний" === password) {
      console.log("Здрастуйте!");
    } else {
      console.log("Невірний пароль!");
    }
  }
} else {
  console.log("я вас не знаю");
}
